INSERT INTO color (value) VALUES
('Белый'),
('Синий'),
('Темно-синий'),
('Графит'),
('Мята');

INSERT INTO size (value) VALUES
('42'),
('44'),
('46'),
('48'),
('50'),
('52'),
('54'),
('56');

INSERT INTO category (name, parent_id) VALUES
('Блуза', NULL),
('Кимоно', NULL),
('Туника', NULL),
('Комбинезон', NULL),
('Джоггеры', NULL),
('Брюки', NULL);

INSERT INTO item (category_id, price, quantity_in_stock, description, name, to_display)
VALUES
(1,
 3690,
 1500,
 'Легкая, удлиненная, свободная блуза с рукавом до локтя и потайной молнией на спинке.',
 'М1 Блуза свободного кроя',
 true
);

INSERT INTO item (category_id, price, quantity_in_stock, description, name, to_display)
VALUES (
2,
 3450,
 1500,
 'Прямые линии, разные углы запаха, пояс для двойного оборота вокруг талии - все это сливается в одной моделе, делая ее стильной и комфортной.',
 'М2 Кимоно',
  true
);

INSERT INTO item (category_id, price, quantity_in_stock, description, name, to_display)
VALUES (
1,
 3590,
 1500,
 'Укороченный рукав, разный уровень передних полочек и спинки, скрытая молния по всей длине изделия.',
 'М3 Блуза два уровня',
 true
);


INSERT INTO item (category_id, price, quantity_in_stock, description, name, to_display)
VALUES (
3,
 3350,
 1500,
 'Рукав 3/4 и боковые разрезы обеспечивают весь спектр движений,... а удлиненная спинка позволяет чувствовать себя комфортно в любом положении.',
 'М4 Туника',
 true
);

INSERT INTO item (category_id, price, quantity_in_stock, description, name, to_display)
VALUES (
1,
 4100,
 1500,
 'Блуза с вставкой со складками, которые заходят на 1/3 спинки. Рукав 3/4. Скрытая молния по всей длине изделия.',
 'М5 Блуза с вставкой',
 true
);

INSERT INTO item (category_id, price, quantity_in_stock, description, name, to_display)
VALUES (
1,
 3850,
 1500,
 'Приталенная блуза с косой планкой и металлической молнией по всей длине спинки.',
 'М6 Блуза с косой планкой',
 true
);


INSERT INTO item (category_id, price, quantity_in_stock, description, name, to_display)
VALUES (
4,
 5950,
 1500,
 'Комбинезон с резиночки на рукавах и штанинах, большими, вместительными карманами и акцентом на талии в виде пояса.',
 'М7 Комбинезон',
 true
);

INSERT INTO item (category_id, price, quantity_in_stock, description, name, to_display)
VALUES (
5,
 3200,
 1500,
 'Джоггеры с резинкой на поясе и двумя карманами.',
 'М8 Джоггеры',
 true
);

INSERT INTO item (category_id, price, quantity_in_stock, description, name, to_display)
VALUES (
6,
 3750,
 1500,
 'Брюки с широким поясом на талии и двумя скрытыми молниями по бокам. Длина брюк 7/8. По запросу длину брюк можно удлинить/укоротить.',
 'М9 Брюки с поясом',
 true
);


INSERT INTO item (category_id, price, quantity_in_stock, description, name, to_display)
VALUES (
6,
 3490,
 1500,
 'Брюки с резинкой на поясе и скрытым шнурком на внутренней части для регулирования. Длина брюк 7/8. При необходимости есть возможность удлинения/укорочения длины.',
 'М10 Брюки с резинкой на поясе',
 true
);




INSERT INTO item_size(item_id, size_id)
VALUES
(1, 1),
(1, 2),
(1, 3),
(1, 4),
(1, 5),
(1, 6),
(1, 7),
(1, 8),

(2, 1),
(2, 2),
(2, 3),
(2, 4),
(2, 5),
(2, 6),
(2, 7),
(2, 8),

(3, 1),
(3, 2),
(3, 3),
(3, 4),
(3, 5),
(3, 6),
(3, 7),
(3, 8),

(4, 1),
(4, 2),
(4, 3),
(4, 4),
(4, 5),
(4, 6),
(4, 7),
(4, 8),

(5, 1),
(5, 2),
(5, 3),
(5, 4),

(6, 1),
(6, 2),
(6, 3),
(6, 4),
(6, 5),
(6, 6),
(6, 7),
(6, 8),

(7, 1),
(7, 2),
(7, 3),
(7, 4),
(7, 5),

(8, 1),
(8, 2),
(8, 3),
(8, 4),
(8, 5),
(8, 6),
(8, 7),
(8, 8),

(9, 1),
(9, 2),
(9, 3),
(9, 4),

(10, 1),
(10, 2),
(10, 3),
(10, 4),
(10, 5),
(10, 6),
(10, 7),
(10, 8);

INSERT INTO item_color(item_id, color_id)
VALUES
(1, 1),
(1, 2),
(1, 3),
(1, 4),
(1, 5),

(2, 1),
(2, 2),
(2, 3),
(2, 4),
(2, 5),

(3, 1),
(3, 2),
(3, 3),
(3, 4),
(3, 5),

(4, 1),
(4, 2),
(4, 3),
(4, 4),
(4, 5),

(5, 1),
(5, 2),
(5, 3),
(5, 4),
(5, 5),

(6, 1),
(6, 2),
(6, 3),
(6, 4),
(6, 5),

(7, 1),
(7, 2),
(7, 3),
(7, 4),
(7, 5),

(8, 1),
(8, 2),
(8, 3),
(8, 4),
(8, 5),

(9, 1),
(9, 2),
(9, 3),
(9, 4),
(9, 5),

(10, 1),
(10, 2),
(10, 3),
(10, 4),
(10, 5);









